[
    "Група БпЛА із Сумщини ➡️ у напрямку Бахмача (Чернігівщина).",
    "Група БпЛА ➡️ у напрямку Павлограда. Харківщина: групи БпЛА ➡️ курсом на Харків, Чугуїв, Золочів, Старий Салтів.",
    "Дніпропетровщина: БпЛА ➡️ повз Губиниху, курсом на захід. Чернігівщина: БпЛА ➡️ у напрямку Мени, Сосниці. Полтавщина: групи БпЛА ➡️ повз Велику Багачку, курсом на південний захід.",
    "Група БпЛА ➡️ у напрямку Павлограда. Харківщина: групи БпЛА ➡️ курсом на Харків, Чугуїв, Золочів, Старий Салтів.",
    "БпЛА на заході Харківщини, курсом на Полтавщину. БпЛА на півдні Полтавщини, курсом на Дніпропетровщину. БпЛА на межі Харківщини та Дніпропетровщини, курс західний. БпЛА західніше Кам'янського на Дніпропетровщині, курс північний. БпЛА на сході Харківщини, курс південний.",
    "Активність ворожих розвідувальних та ударних БпЛА на півночі Харківщини.",
    "Група БпЛА із Сумщини ➡️ у напрямку Бахмача (Чернігівщина)."
]