import re
from geopy.geocoders import Nominatim

class LocationExtractor: 
    def __init__(self):
        self.geolocator = Nominatim(user_agent="telegram_scraper_v1")

        # на сході Чернігівщини
        # на межі Харківської, Сумської, Полтавської областей
        # східної межі Потавщини
        # до Одеси
        # курсом на Одесу/Чорноморськ
        # на Запоріжжі
        # на південь Сумщини
        # на Житомирщині, Рівненщині та Волинь
        # УВАГА! Київ!
        # на південному заході Харківщини
        # м.Київ
        # напрямку на/повз Чернігів
        # в напрямку Києва
        # по межі Миколаївщини
        # в напрямку Києва, Черкас, Полтави
        # південніше Павлограду
        # на північ Харківщини
        # повз Печеніги
        self.location_patterns = [
            # direct location
            r'на\s+([\u0410-\u042F][\u0400-\u04FF]+(?:\s+[\u0410-\u042F][\u0400-\u04FF]+)*)'
            r'на\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на н.п.\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'над н.п.\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'поблизу н.п.\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'в районі н.п.\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'в напрямку н.п.\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'повз\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})', 
            r'до\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на межі\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'межі\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'в напрямку\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'в напрямі\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'м.\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'м.([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'([\u0410-\u042F][\u0400-\u04FF\s]{2,30}\s+обл.)',
            r'([\u0410-\u042F][\u0400-\u04FF\s]{2,30}\s+область)',
            r'([\u0410-\u042F][\u0400-\u04FF\s]{2,30}\s+області)',

            # NEWS
            r'на сході\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на півночі\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на півдні\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на сході\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на північ\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на південь\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на захід\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'на схід\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'південніше\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'північніше\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'східніше\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
            r'західніше\s+([\u0410-\u042F][\u0400-\u04FF\s]{2,30})',
        ]

    def get_location(self, text):
        print(f'Extracting location from message :{text}')
        potential_locations = []
        
        for pattern in self.location_patterns:
            matches = re.findall(pattern, text)
            potential_locations.extend(matches)

        print(potential_locations)
