LOCATION_CONFIG = {
    "prepos_space": [
        'на', 'у', 'в', 'до', 'з', 'від', 'поблизу', 'біля', 'коло', 'під', 'через',
        'на н.п.', 'над н.п.', 'поблизу н.п.', 'в районі н.п.', 'в напрямку н.п.',
        'повз', 'межі', 'в напрямку', 'в напрямі', 'над', 'на сході', 'на півночі',
        'на півдні', 'на сході', 'на північ', 'на півночі', 'на південь', 'на захід',
        'на схід', 'південніше', 'північніше', 'східніше', 'західніше', 'на/повз'
    ],
    "prepos_no_space": [
        'м.'
    ],
    "postpos": [
        'обл.', 'область', 'області'
    ],
    "pattern":  r'(?:{prepositions})\s+([\u0410-\u042F][\u0400-\u04FF]+(?:\s+[\u0410-\u042F][\u0400-\u04FF]+)*)'
}

# на сході Чернігівщини
# на межі Харківської, Сумської, Полтавської областей
# східної межі Потавщини
# до Одеси
# курсом на Одесу/Чорноморськ
# на Запоріжжі
# на південь Сумщини
# на Житомирщині, Рівненщині та Волинь
# УВАГА! Київ!
# на південному заході Харківщини
# м.Київ
# напрямку на/повз Чернігів
# в напрямку Києва
# по межі Миколаївщини
# в напрямку Києва, Черкас, Полтави
# південніше Павлограду
# на північ Харківщини
# повз Печеніги